{
  "backend/main.mo": "Actor module managing user profiles and premium status with access control and admin/user permission checks.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of major frontend components, pages, data files, and settings modules.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, dark mode values, and base element styling.",
  "frontend/index.html": "HTML entry point providing root container and loading the main React script.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, wraps the app with QueryClientProvider and ThemeProvider, and initializes all page routes.",
  "frontend/src/components/chapters/ChapterList.tsx": "Renders a subject header and a grid of chapter cards linking to chapter detail pages.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the global app layout with navigation header, main content container, and footer.",
  "frontend/src/components/learning-modes/LearningModeIcon.tsx": "Displays learning mode icons from a sprite sheet based on mode ID and calculated background positioning.",
  "frontend/src/components/nav/PrimaryNav.tsx": "Responsive primary navigation bar with desktop links and mobile sheet drawer, highlighting active routes.",
  "frontend/src/components/settings/PremiumSettingsCard.tsx": "UI card for premium status that handles login via Internet Identity and triggers premium upgrade mutations.",
  "frontend/src/components/settings/SettingsCategorySection.tsx": "Renders a settings category with toggles, selects, and sliders tied to an update handler.",
  "frontend/src/data/learningModes.ts": "Exports a list of learning mode definitions with ids, names, and descriptions.",
  "frontend/src/data/ncertClass10Chapters.ts": "Defines subjects and a mapping of NCERT Class 10 chapters for each subject.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, premium status, and upgrade actions via the actor.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for theming, including dark, high-contrast, and compact modes.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/ChapterDetailPage.tsx": "Displays chapter details with navigation, subject info, and links to available learning modes, including error handling for missing chapters.",
  "frontend/src/pages/ChaptersPage.tsx": "Renders a tabbed interface for browsing NCERT Class 10 chapters by subject with scrollable tabs.",
  "frontend/src/pages/HomePage.tsx": "Provides the landing page with a hero banner, quick-access cards, and feature highlights for the learning platform.",
  "frontend/src/pages/LearningModeRunPage.tsx": "Shows a specific learning mode's detail and related chapter context with breadcrumb navigation and a placeholder content area.",
  "frontend/src/pages/LearningModesPage.tsx": "Lists all learning modes with icons and descriptions, linking to each mode’s run page.",
  "frontend/src/pages/SettingsPage.tsx": "Displays all settings categories, allowing users to adjust preferences using the settings schema and hooks.",
  "frontend/src/settings/applySettings.ts": "Applies user settings to the document root, updating classes and CSS variables for theme, spacing, motion, and contrast.",
  "frontend/src/settings/settingsSchema.ts": "Defines TypeScript interfaces for settings and provides a schema of categorized app settings with defaults and options.",
  "frontend/src/settings/useSettings.ts": "Implements a React hook to load, persist, update, and reset user settings using localStorage and applies them on change.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, storing them in sessionStorage, and managing persisted or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, typography, animations, container settings, and plugin integrations.",
  "project_state.json": "Stores project metadata, requirements, existing features, and known issues for the Class 10 learning app."
}