{
  "backend/main.mo": "Actor implementing user profile storage with permission checks for viewing, saving, and premium status upgrades or downgrades.",
  "feature_evidence.json": "Feature evidence report listing features, related files, components, and test IDs for learning mode improvements and chapter-context handling.",
  "frontend-file-summaries.txt": "Reference file mapping frontend paths to concise descriptions of their functionality across the app.",
  "frontend/index.css": "Global Tailwind-based styling defining CSS variables for light/dark themes and applying base layout rules.",
  "frontend/index.html": "Base HTML document mounting the React app and loading the main TypeScript entrypoint.",
  "frontend/src/App.tsx": "Main React app that configures TanStack Router routes, query client, theming, and global layout.",
  "frontend/src/components/chapters/ChapterList.tsx": "Renders a subject section with chapter cards linking to detailed chapter pages.",
  "frontend/src/components/layout/AppLayout.tsx": "App-wide layout providing navigation, content container, and footer.",
  "frontend/src/components/learning-modes/LearningModeIcon.tsx": "Displays a learning mode icon using coordinates from a sprite sheet based on modeId.",
  "frontend/src/components/learning-modes/run/LearningModeActivityRenderer.tsx": "Loads activity config for a modeId and renders the appropriate interactive learning mode component or an error alert.",
  "frontend/src/components/learning-modes/run/modes/FillBlanksMode.tsx": "Interactive fill‑in‑the‑blank quiz with hints, correctness feedback, scoring, and navigation between questions.",
  "frontend/src/components/learning-modes/run/modes/FlashcardsMode.tsx": "Flashcard viewer allowing users to flip cards, navigate between them, and reset the current card state.",
  "frontend/src/components/learning-modes/run/modes/MatchFollowingMode.tsx": "Matching activity where users pair terms with definitions, track progress, and reset matches.",
  "frontend/src/components/learning-modes/run/modes/NotesSummaryMode.tsx": "Expandable notes viewer where users check off bullet points and track overall completion progress.",
  "frontend/src/components/learning-modes/run/modes/PracticeProblemsMode.tsx": "Practice problem interface letting users type solutions, reveal step‑by‑step answers, and move through multiple problems.",
  "frontend/src/components/learning-modes/run/modes/QuizMode.tsx": "Multiple‑choice quiz with scoring, answer validation, explanations, and step‑through question navigation.",
  "frontend/src/components/learning-modes/run/modes/TimerChallengeMode.tsx": "React timer-based challenge mode that cycles through questions, tracks time, answers, and progress, and manages start/pause/reset states.",
  "frontend/src/components/learning-modes/run/modes/TrueFalseMode.tsx": "True/false quiz component that shows statements, records answers, displays correctness with explanations, and tracks score across questions.",
  "frontend/src/components/nav/PrimaryNav.tsx": "Primary navigation bar with desktop and mobile layouts, highlighting active routes and offering links to main app sections.",
  "frontend/src/components/settings/PremiumSettingsCard.tsx": "Premium subscription card handling login, upgrade flow, loading states, and displaying premium benefits or prompts.",
  "frontend/src/components/settings/SettingsCategorySection.tsx": "Settings section renderer that displays toggles, selects, and sliders based on setting definitions and updates values via callbacks.",
  "frontend/src/data/learningModeActivities.ts": "Defines activity configurations for learning modes with sample content generators for flashcards, quizzes, MCQs, fill-in-the-blanks, matching, and more.",
  "frontend/src/data/learningModes.ts": "Defines the LearningMode interface and a list of learning mode options with ids, names, and descriptions.",
  "frontend/src/data/ncertClass10Chapters.ts": "Defines subject and chapter structures and provides NCERT Class 10 subjects with their chapter lists.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for fetching and updating user profiles and premium status using the backend actor.",
  "frontend/src/index.css": "Sets global Tailwind styles, CSS variables for themes, and utility layers including dark mode and high-contrast settings.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentityProvider.",
  "frontend/src/pages/ChapterDetailPage.tsx": "Renders chapter details, breadcrumbs, and learning mode options based on selected subject and chapter.",
  "frontend/src/pages/ChaptersPage.tsx": "Renders tabs for Class 10 subjects and displays chapter lists per subject using ChapterList.",
  "frontend/src/pages/HomePage.tsx": "Displays the home hero banner and quick-access cards linking to chapters, learning modes, and settings.",
  "frontend/src/pages/LearningModeRunPage.tsx": "Loads and validates a learning mode and optional chapter context, showing mode details and rendering activities.",
  "frontend/src/pages/LearningModesPage.tsx": "Lists all learning modes with icons and links to start each mode.",
  "frontend/src/pages/SettingsPage.tsx": "Displays settings categories and controls, using useSettings to read and update user preferences.",
  "frontend/src/settings/applySettings.ts": "Applies visual and behavioral settings to the document root by toggling classes and CSS variables.",
  "frontend/src/settings/settingsSchema.ts": "Defines the schema for all settings categories, their fields, types, defaults, and options.",
  "frontend/src/settings/useSettings.ts": "Manages loading, saving, applying, and updating settings via React state and localStorage.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, extended color tokens, custom animations, fonts, and layout settings, and enables typography, container-queries, and animation plugins.",
  "project_state.json": "Defines the project state for a Class 10 NCERT learning app, listing features, issues, and metadata for versioned build planning."
}