{
  "kind": "build_request",
  "title": "Replace Learning Mode placeholder with working interactive content",
  "projectName": "Class 10 Learning Hub",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Replace the placeholder content in the Learning Mode Run page so that opening any learning mode shows real, mode-specific learning content and at least one interactive element (not just the message 'This learning mode is ready for you...'). The experience must work for all 20 predefined modeIds in frontend/src/data/learningModes.ts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "When I am clicking any learning modes only message appears This learning mode is ready for you. Content and interactive exercises will be displayed here. Fix above error"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /learning-modes/$modeId for each of the 20 learningModes renders mode-specific UI (not the generic placeholder block currently shown in LearningModeRunPage).",
        "Each mode includes at least one interactive control (e.g., selectable answer choices, flip/reveal, check answer, next/previous, timer start/stop) that changes UI state.",
        "No console errors occur when launching any mode from Learning Modes list or Chapter Detail page."
      ]
    },
    {
      "id": "REQ-11",
      "text": "When a chapter context is provided (via search params subject and chapterId), show chapter-tailored content for the selected learning mode; when chapter context is missing, keep the existing 'Choose a Chapter' call-to-action and ensure the mode UI clearly indicates that chapter selection is required for chapter-specific practice.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "When I am clicking any learning modes only message appears This learning mode is ready for you. Content and interactive exercises will be displayed here. Fix above error"
        ]
      },
      "acceptanceCriteria": [
        "Launching a learning mode from ChapterDetailPage (which passes subject and chapterId) shows content that references the selected chapter (e.g., chapter title/number) within the mode’s main content area.",
        "Launching a learning mode from LearningModesPage without a chapter selected does not show the broken/empty placeholder; it shows a usable mode landing state plus a working 'Choose a Chapter' button linking to /chapters.",
        "Invalid subject/chapterId values in the URL do not crash the page; the UI falls back to the non-chapter mode landing state and still renders mode-specific UI."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/components/ui (Shadcn UI components must be composed, not modified).",
    "Do not modify frontend immutable paths listed in SYSTEM_CONTEXT (Internet Identity and actor hooks, and main.tsx are read-only)."
  ],
  "nonGoals": [
    "Do not add external APIs or online content fetching to populate learning mode content.",
    "Do not implement full NCERT textbook content ingestion/parsing as part of this fix."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}