{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Interactive, mode-specific Learning Mode Run content (all 20 modes)",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Replace LearningModeRunPage placeholder with real, mode-specific interactive learning content for all 20 predefined learning mode IDs.",
      "acceptanceCriteria": [
        "Navigating to /learning-modes/$modeId for each of the 20 learningModes renders mode-specific UI (not the generic placeholder block currently shown in LearningModeRunPage).",
        "Each mode includes at least one interactive control (e.g., selectable answer choices, flip/reveal, check answer, next/previous, timer start/stop) that changes UI state.",
        "No console errors occur when launching any mode from Learning Modes list or Chapter Detail page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/learningModeActivities.ts",
          "operation": "create",
          "description": "Create a local, offline activity/config registry for all 20 learningModes (keyed by modeId) that provides mode-specific prompts, sample items, and per-mode interaction type(s) (e.g., flashcard flip set, MCQ set, matching pairs, true/false statements, revision checklist, timer settings). This is the single source of truth used by the run UI to guarantee every modeId has non-placeholder content."
        },
        {
          "path": "frontend/src/components/learning-modes/run/LearningModeActivityRenderer.tsx",
          "operation": "create",
          "description": "Add a renderer component that takes (modeId, optional chapterContext) and renders mode-specific interactive UI by selecting the matching activity config. Ensure each of the 20 modeIds includes at least one interactive control that updates React state (e.g., flip/reveal for flashcards, select+check for quiz/mcq, input+check for fill-blanks, pair selection for match, toggle for true-false, start/stop timer for speed-test/exam-prep, next/previous navigation for revision/summary/notes). Compose (do not modify) shadcn-ui components (e.g., Card, Button, Badge, Alert, etc.) to build the UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/learning-modes/run/modes/FlashcardsMode.tsx",
          "operation": "create",
          "description": "Implement the Flashcards mode interactive UI (flip/reveal + next/previous). Compose shadcn-ui components; do not modify any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/learning-modes/run/modes/QuizMode.tsx",
          "operation": "create",
          "description": "Implement Quiz/MCQ-style interactive UI (selectable choices + check answer + explanation reveal). Compose shadcn-ui components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/learning-modes/run/modes/FillBlanksMode.tsx",
          "operation": "create",
          "description": "Implement Fill-in-the-Blanks UI (text input(s) + check + reveal correct). Compose shadcn-ui components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/learning-modes/run/modes/MatchFollowingMode.tsx",
          "operation": "create",
          "description": "Implement Match-the-Following UI (select left term then right definition; track matches; reset). Compose shadcn-ui components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/learning-modes/run/modes/TrueFalseMode.tsx",
          "operation": "create",
          "description": "Implement True/False UI (toggle selection + check + feedback). Compose shadcn-ui components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/learning-modes/run/modes/TimerChallengeMode.tsx",
          "operation": "create",
          "description": "Implement timer-based interactive UI used by speed-test/exam-prep/challenge (start/stop/reset timer + progress feedback + next item). Compose shadcn-ui components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/learning-modes/run/modes/NotesSummaryMode.tsx",
          "operation": "create",
          "description": "Implement interactive Notes/Summary-style UI (expand/collapse key points, mark-as-done checklist, or reveal sections) used by summary/notes/revision. Compose shadcn-ui components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/learning-modes/run/modes/PracticeProblemsMode.tsx",
          "operation": "create",
          "description": "Implement Practice Problems UI (show problem -> user self-solution textarea -> reveal step-by-step solution -> next). Compose shadcn-ui components. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LearningModeRunPage.tsx",
          "operation": "modify",
          "description": "Replace the current placeholder block inside the Learning Content card with the new LearningModeActivityRenderer so /learning-modes/$modeId always renders mode-specific interactive content for every modeId in frontend/src/data/learningModes.ts. Keep the existing breadcrumb/header, and ensure the page passes along resolved chapter context (if valid) to the renderer. Compose shadcn-ui components only; do not modify any files under frontend/src/components/ui. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Support chapter-tailored learning mode content when subject/chapterId search params are provided; otherwise show a usable mode landing state with a working Choose a Chapter CTA and safe fallback for invalid params.",
      "acceptanceCriteria": [
        "Launching a learning mode from ChapterDetailPage (which passes subject and chapterId) shows content that references the selected chapter (e.g., chapter title/number) within the mode’s main content area.",
        "Launching a learning mode from LearningModesPage without a chapter selected does not show the broken/empty placeholder; it shows a usable mode landing state plus a working 'Choose a Chapter' button linking to /chapters.",
        "Invalid subject/chapterId values in the URL do not crash the page; the UI falls back to the non-chapter mode landing state and still renders mode-specific UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LearningModeRunPage.tsx",
          "operation": "modify",
          "description": "Harden chapter-context resolution: treat chapter context as valid only when both subject is known and chapterId resolves to a real chapter; otherwise set chapter context to undefined and render a non-chapter landing state. Ensure the UI clearly indicates that chapter selection is required for chapter-specific practice (e.g., an inline Alert/Badge near the activity area), while still rendering mode-specific interactive content. Keep and wire a working 'Choose a Chapter' Link/Button to /chapters when chapter context is missing. Compose shadcn-ui components (Alert, Badge, Button, Card) without editing frontend/src/components/ui. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/data/learningModeActivities.ts",
          "operation": "modify",
          "description": "Extend activity config to accept optional chapterContext inputs (subject name + chapter number/title) and generate chapter-tailored strings/content variants when provided (e.g., headings, prompts, example questions referencing the chapter title). Ensure every mode has a meaningful non-chapter fallback variant to avoid empty/placeholder UI."
        },
        {
          "path": "frontend/src/components/learning-modes/run/LearningModeActivityRenderer.tsx",
          "operation": "modify",
          "description": "Update renderer to (1) display chapter-aware labels/prompts in the main content area when chapterContext is present, and (2) show a clear chapter-required hint state when missing, without hiding the mode-specific interactive component. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}